Tekla Open API Reference for Tekla Structures 2025
FabricatorProfilesAndMaterials Class
 The FabricatorProfilesAndMaterials class contains methods for converting fabricator profiles and materials to Tekla Structures.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.FabricatorProfilesAndMaterials
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class FabricatorProfilesAndMaterials
<SerializableAttribute>
Public NotInheritable Class FabricatorProfilesAndMaterials
The FabricatorProfilesAndMaterials type exposes the following members.
Methods
Name | Description
ConvertSourceFile
 Converts a fabricator profile catalog source file to an XML file that contains a list of valid Tekla Structures catalog profiles and materials.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace